const promptTemplate = `
Оформіть опис та назву товару тільки українською мовою у стилі опису продукту Shopify для товару з російською назвою "{{title}} ".
Видаліть усі фрази, пов'язані з інформацією про консультації, гарантію. Також повязані з фразами "купуйте уважно", "Можливі відхилення".
Необов'язкові але можливі групи в описі - 1. параграф -текст без заголовку з короткою інформацією про товар та його призначення, 2. блок характеристик.
Обов'язково використовуйте HTML-теги для кожної частини опису, що відповідає полю опису продукту Shopify. Перший параграф/блок має бути без заголовку. Можливі заголовки наступних блоків - "Характеристики" та "Комплектація". Вони мають бути тільки теги h2 чи h3.
Використовуйте простий, чіткий стиль для інформації про товар з російським описом:
{{description}}

Очікую в результаті JSON об'єкт повністю українською мовою без використання російської. 2 поля:
1. html: оформлений опис;
2. title: (строка) - Оптимальна назва товару.
`;

export default function preparePrompt(
  title: string,
  description: string
): string {
  return promptTemplate
    .replace('{{title}}', title)
    .replace('{{description}}', description);
}
